content/posts/20200602031108-ifu.md
+++
title = "IFU"
author = ["Daniel Biasiotto"]
draft = false
+++

Preferibile ad una ALU completa


## Per ogni istruzione {#per-ogni-istruzione}


### PC e' passato attraverso l'[ALU]({{< relref "20200530050045-alu.md" >}}) e incrementato {#pc-e-passato-attraverso-l-alu--20200530050045-alu-dot-md--e-incrementato}


### PC e' usato per leggere il byte {#pc-e-usato-per-leggere-il-byte}


### gli operandi sono letti {#gli-operandi-sono-letti}


### l'ALU esegue un calcolo e i risultati sono memorizzati {#l-alu-esegue-un-calcolo-e-i-risultati-sono-memorizzati}


## permette di rimuovere il carico dalla ALU {#permette-di-rimuovere-il-carico-dalla-alu}


## incrementa il PC indipendentemente {#incrementa-il-pc-indipendentemente}


## legge i byte del programma prima che siano necessari: Pre-Fetching {#legge-i-byte-del-programma-prima-che-siano-necessari-pre-fetching}

-   implementa piu' efficientemente operandi wide
    -   scrive i byte in
        1.  MBR1
            -   8bit
        2.  MBR2

            -   16bit

            questi nuovi registri non si interfacciano piu' direttamente alla memoria
            si interfacciano invece alla IFU


## Composizione {#composizione}


### porta di lettura dalla memoria da 4 Byte {#porta-di-lettura-dalla-memoria-da-4-byte}


#### Memoria a scorrimento - Shift Register {#memoria-a-scorrimento-shift-register}

6 byte:
[ ][ ][ ][ ][ ][1] --&gt; [ ][ ][ ][ ][2][1]

<!--list-separator-->

-  Quando richiesto MBR1 (per un goto MBR)

    Il contenuto della posizione piu' a destra e' spostato in MBR1

<!--list-separator-->

-  Quando e' richiesto MBR2 (offset)

    Contenuto delle due posizioni piu' a destra sono invertite e spostate su MBR2

    -   questo ci permette di non usare
        -   Byte 1 &lt;&lt;
        -   Byte1 OR Byte 2


### incrementatore di +1 o +2 {#incrementatore-di-plus-1-o-plus-2}

Dal PC al PC


### IMAR {#imar}

Accede alla memoria allo stesso modo di MAR - con uno shift &lt;&lt; 2

-   richiede parole da 4 Byte

In questo modo popola il buffer (Shift Register)


#### A sua volta connesso ad un incrementatore +1 {#a-sua-volta-connesso-ad-un-incrementatore-plus-1}


#### una scrittura su PC scrive a sua volta su IMAR {#una-scrittura-su-pc-scrive-a-sua-volta-su-imar}

PC e' copiato con i 2 bit meno significativi su IMAR


#### E' questo registro che comunica con la memoria {#e-questo-registro-che-comunica-con-la-memoria}

<!--list-separator-->

-  al peggio non uso i byte aggiuntivi caricati

<!--list-separator-->

-  al meglio in quei byte ho valori che usero'


## Questo permette di automatizzare il ciclo di Fetch Main1 {#questo-permette-di-automatizzare-il-ciclo-di-fetch-main1}
